Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

# Compared %@. %d differences. Nothing has been written.
source: Compared %1$@. %2$d differences. Nothing has been written.
fr: Comparé %1$@. %2$d différences. Rien n'a été écrit.
ko: %1$@을(를) 비교했습니다. 차이점 %2$d개. 아무것도 기록되지 않았습니다.
tr: %1$@ karşılaştırıldı. %2$d fark. Hiçbir şey yazılmadı.
vi: Đã so sánh %1$@. %2$d khác biệt. Chưa ghi gì cả.
zh_hans: 已比较 %1$@。%2$d 处差异。尚未写入任何内容。
zh_hant: 已比較 %1$@。%2$d 處差異。尚未寫入任何內容。

source: The file has not finished opening.
fr: Le fichier n'a pas encore été complètement ouvert.

source: Referencing column
fr: Colonne de référence
ko: 참조하는 열
tr: Başvuran sütun
vi: Cột tham chiếu
zh_hans: 发起引用的列
zh_hant: 發起參照的欄位

source: Encoding:
fr: Encodage :
ko: 인코딩:
tr: Kodlama:
vi: Mã hóa:
zh_hans: 编码:
zh_hant: 編碼：

source: Create all columns
fr: Créer toutes les colonnes
ko: 모든 열 생성
tr: Tüm sütunları oluştur
vi: Tạo tất cả các cột
zh_hans: 创建所有列
zh_hant: 建立所有欄位

source: No tokens created
fr: Aucun jeton n'a été créé
ko: 생성된 토큰 없음
tr: Oluşturulmuş token yok
vi: Chưa tạo token nào
zh_hans: 未创建令牌
zh_hant: 尚未建立權杖

source: FIELDS
fr: CHAMPIS
tr: ALANLAR
vi: TRƯỜNG
zh_hans: 字段
zh_hant: 欄位

source: A different file already exists at %@.
fr: Un fichier différent existe déjà à %@.
ko: %@ 위치에 다른 파일이 이미 있습니다.
tr: %@ konumunda zaten farklı bir dosya var.
vi: Đã có một tệp khác tại %@.
zh_hans: %@ 处已存在另一个文件。
zh_hant: %@ 已存在另一個檔案。

source: License key
fr: Clé de licence
ko: 라이선스 키
tr: Lisans anahtarı
vi: Khóa giấy phép
zh_hans: 许可证密钥
zh_hant: 授權金鑰

source: Renamed
fr: Renommé

source: Choose the SQLite extension libraries to load when this connection opens.
fr: Choisissez les bibliothèques d'extensions SQLite à charger lorsque cette connexion s'ouvre.

source: The output of a command
fr: La sortie d'une commande

source: Restore This Version
fr: Restaurer cette version

source: TablePro has not reached the license server in 30 days, so Pro features are paused.
fr: TablePro n'a pas atteint le serveur de licence depuis 30 jours, donc les fonctionnalités Pro sont suspendues.
ko: TablePro가 30일 동안 라이선스 서버에 연결하지 못해 Pro 기능이 일시 중지되었습니다.
tr: TablePro 30 gündür lisans sunucusuna ulaşamadı, bu yüzden Pro özellikleri duraklatıldı.
vi: TablePro chưa kết nối được máy chủ giấy phép trong 30 ngày, nên các tính năng Pro đã tạm dừng.
zh_hans: TablePro 已 30 天未连接许可证服务器，因此 Pro 功能已暂停。
zh_hant: TablePro 已 30 天未連接授權伺服器，因此 Pro 功能已暫停。

source: Column of %@
fr: Colonne de %@

source: Export the filtered activity log to CSV
fr: Exporter le journal d'activité filtré vers CSV
ko: 필터링된 활동 로그를 CSV로 내보내기
tr: Filtrelenmiş etkinlik günlüğünü CSV olarak dışa aktar
vi: Xuất nhật ký hoạt động đã lọc ra CSV
zh_hans: 将筛选后的活动日志导出为 CSV
zh_hant: 將篩選後的活動記錄匯出為 CSV

source: Google Cloud globally distributed SQL
fr: SQL distribué mondialement par Google Cloud

source: Return the CREATE statement for one table or view.
fr: Renvoie la déclaration CREATE pour une table ou une vue.
ko: 한 테이블 또는 뷰의 CREATE 명령문을 반환합니다.
tr: Bir tablo veya görünüm için CREATE ifadesini döndürür.
vi: Trả về câu lệnh CREATE cho một bảng hoặc view.
zh_hans: 返回某张表或视图的 CREATE 语句。
zh_hant: 回傳某張資料表或檢視表的 CREATE 陳述式。

source: Query for a question on %@
fr: Demande d'une question sur %@
ko: %@에 대한 질문의 쿼리
tr: %@ üzerindeki bir soru için sorgu
vi: Truy vấn cho một câu hỏi trên %@
zh_hans: 针对 %@ 上某个问题的查询
zh_hant: 針對 %@ 上某個問題的查詢

source: Rows Compare Data
fr: Comparer les données des lignes
ko: 행은 데이터를 비교합니다
tr: Satırlar Veri Karşılaştırmasında
vi: Dòng thuộc so sánh dữ liệu
zh_hans: 行属于数据比较
zh_hant: 列屬於資料比較

source: History Limit:
fr: Limite de l'historique :
ko: 기록 제한:
tr: Geçmiş Limiti:
vi: Giới hạn lịch sử:
zh_hans: 历史记录上限：
zh_hant: 歷程記錄上限：

source: Session state
fr: État de la session
ko: 세션 상태
tr: Oturum durumu
vi: Trạng thái phiên
zh_hans: 会话状态
zh_hant: 工作階段狀態

source: %1$@: more than one source column is mapped to %2$@.
fr: %1$@ : plus d'une colonne de source est mappée à %2$@.

source: This list is a capped preview. Apply covers every difference, not only the rows listed here.
fr: Cette liste est une prévisualisation limitée. Les couvertures s'appliquent à toutes les différences, pas seulement aux lignes listées ici.
ko: 이 목록은 개수가 제한된 미리 보기입니다. 적용은 여기 나열된 행뿐 아니라 모든 차이점을 포함합니다.
tr: Bu liste sınırlı bir önizlemedir. Uygula, yalnızca burada listelenen satırları değil her farkı kapsar.
vi: Danh sách này là bản xem trước có giới hạn. Áp dụng bao trùm mọi khác biệt, không chỉ các dòng liệt kê ở đây.
zh_hans: 此列表是有上限的预览。“应用”涵盖每一处差异，而不只是这里列出的行。
zh_hant: 此清單是有上限的預覽。「套用」涵蓋每一處差異，而不只是這裡列出的列。

source: %@ is a primary key
fr: %@ est une clé primaire

source: Query:
fr: Question :
ko: 쿼리:
vi: Truy vấn:
zh_hans: 查询：
zh_hant: 查詢：

source: Read Preference
fr: Préférence de lecture
ko: 읽기 기본 설정

source: SQL query editor
fr: Éditeur de requêtes SQL
ko: SQL 쿼리 편집기
tr: SQL sorgu düzenleyicisi
vi: Trình soạn truy vấn SQL
zh_hans: SQL 查询编辑器
zh_hant: SQL 查詢編輯器

source: Row
fr: Rangée
ko: 행
tr: Satır
vi: Hàng
zh_hans: 行
zh_hant: 列

source: Add Theme
fr: Ajouter un thème
ko: 테마 추가
tr: Tema Ekle
vi: Thêm giao diện
zh_hans: 添加主题
zh_hant: 加入佈景主題

source: Rows set to “same element” must all match one %@ element
fr: Les lignes définies sur "même élément" doivent toutes correspondre à un élément %@.
ko: “동일 요소”로 설정된 행은 모두 하나의 %@ 요소와 일치해야 합니다
tr: “Aynı öğe” olarak ayarlanan satırların tümü tek bir %@ öğesiyle eşleşmelidir
vi: Các dòng đặt là “cùng một phần tử” đều phải khớp với một phần tử %@ duy nhất
zh_hans: 设为“同一元素”的行必须全部匹配同一个 %@ 元素
zh_hant: 設為“同一元素”的列必須全部符合同一個 %@ 元素

source: "%@" was modified on both this Mac and another device.
fr: «%@» a été modifié sur ce Mac et sur un autre appareil.
ko: "%@" 항목이 이 Mac과 다른 기기에서 모두 수정되었습니다.
tr: "%@" bu Mac ve başka bir cihazda değiştirildi.
vi: "%@" đã bị thay đổi trên cả máy Mac này và thiết bị khác.
zh_hans: "%@" 在此 Mac 和另一台设备上均已修改。
zh_hant: 「%@」在這台 Mac 和另一台裝置上都被修改了。

source: Status
fr: Statut
ko: 상태
tr: Durum
vi: Trạng thái
zh_hans: 状态
zh_hant: 狀態

source: Show workspace rail
fr: Afficher le rail de l'espace de
ko: 워크스페이스 레일 보기
tr: Çalışma alanı şeridini göster
vi: Hiện thanh không gian làm việc
zh_hans: 显示工作区栏
zh_hant: 顯示工作區列

source: Disable
fr: Désactiver
ko: 비활성화
tr: Devre Dışı Bırak
vi: Tắt
zh_hans: 禁用
zh_hant: 停用

source: Safe mode level
fr: Niveau de mode sécurisé
ko: 안전 모드 수준
tr: Güvenli mod düzeyi
vi: Mức Chế độ an toàn
zh_hans: 安全模式级别
zh_hant: 安全模式層級

source: Panel State
fr: État du panneau
ko: 패널 상태
tr: Panel Durumu
vi: Trạng thái bảng điều khiển
zh_hans: 面板状态
zh_hant: 面板狀態

source: The save also truncated or dropped a table.
fr: L'enregistrement a également tronqué ou supprimé une table.
ko: 이 저장은 테이블을 잘라내거나 삭제하기도 했습니다.
tr: Bu kaydetme aynı zamanda bir tabloyu boşalttı veya sildi.
vi: Lần lưu này còn truncate hoặc xoá một bảng.
zh_hans: 这次保存还清空或删除了一张表。
zh_hant: 這次儲存還清空或刪除了一張資料表。

source: Attributes
fr: Attributs
ko: 속성
tr: Öznitelikler
vi: Thuộc tính
zh_hans: 属性
zh_hant: 屬性

source: Remove Column
fr: Supprimer la colonne
ko: 열 제거
tr: Sütunu Kaldır
vi: Gỡ cột
zh_hans: 移除列
zh_hant: 移除欄位

source: Escape character
fr: Caractère d'échappement
ko: 이스케이프 문자
tr: Kaçış karakteri
vi: Ký tự thoát
zh_hans: 转义字符
zh_hant: 跳脫字元

source: Click the menu in the Agent Panel header and choose Settings
fr: Cliquez sur le menu dans le haut du panneau de l'agent et choisissez Paramètres.
ko: 에이전트 패널 헤더의 메뉴를 클릭하고 설정을 선택하십시오
tr: Ajan paneli başlığındaki menüye tıklayın ve Ayarlar'ı seçin
vi: Bấm vào menu trên tiêu đề bảng Agent rồi chọn Cài đặt
zh_hans: 点按Agent面板标题栏中的菜单并选择"设置"
zh_hant: 點按 Agent 面板標題列中的選單，然後選擇「設定」

source: Do not show this again
fr: Ne montrez pas ça à nouveau
ko: 다시 표시하지 않기
tr: Bunu bir daha gösterme
vi: Không hiện lại
zh_hans: 不再显示
zh_hant: 不再顯示

source: List the users and roles defined on the server, with their attributes and role memberships.
fr: Listez les utilisateurs et les rôles définis sur le serveur, avec leurs attributs et leurs adhésions aux rôles.
ko: 서버에 정의된 사용자와 역할을 속성 및 역할 소속과 함께 나열합니다.
tr: Sunucuda tanımlı kullanıcıları ve rolleri, öznitelikleri ve rol üyelikleriyle birlikte listeler.
vi: Liệt kê các người dùng và vai trò được định nghĩa trên máy chủ, kèm thuộc tính và tư cách thành viên vai trò.
zh_hans: 列出服务器上定义的用户和角色，以及它们的属性和角色成员关系。
zh_hant: 列出伺服器上定義的使用者和角色，以及它們的屬性和角色成員關係。

source: Choose where to save the dump of “%@”.
fr: Choisissez où enregistrer le déversement de "%@".
ko: “%@”의 덤프를 저장할 위치를 선택하십시오.
tr: “%@” dökümünün nereye kaydedileceğini seçin.
vi: Chọn nơi lưu bản dump của “%@”.
zh_hans: 选择“%@”转储文件的保存位置。
zh_hant: 選擇要將「%@」的備份檔儲存至何處。

source: Export %1$lld table to %2$@
fr: Exporter la table %1$lld vers %2$@

source: Activate a Team license to publish to the team library.
fr: Activez une licence d'équipe pour publier dans la bibliothèque d'équipe.
ko: 팀 라이브러리에 게시하려면 Team 라이선스를 활성화하십시오.
tr: Takım kitaplığına yayınlamak için bir Team lisansı etkinleştirin.
vi: Kích hoạt giấy phép Team để xuất bản lên thư viện nhóm.
zh_hans: 激活 Team 许可证后才能发布到团队库。
zh_hant: 啟用 Team 授權後才能發佈到團隊庫。

source: Rename Column
fr: Renommer la colonne
ko: 열 이름 변경
tr: Sütunu Yeniden Adlandır
vi: Đổi tên cột
zh_hans: 重命名列
zh_hant: 重新命名欄位

source: Sort By
fr: Trier par

source: Copy the full error to the clipboard
fr: Copiez l'erreur complète dans le presse-papiers.
ko: 전체 오류를 클립보드에 복사
tr: Hatanın tamamını panoya kopyala
vi: Sao chép toàn bộ lỗi vào bộ nhớ tạm
zh_hans: 将完整错误复制到剪贴板
zh_hant: 將完整錯誤複製到剪貼簿

source: Leave empty unless the certificate names another host
fr: Laissez vide à moins que le certificat n'indique un autre hôte.

source: Enable rule
fr: Activer la règle

source: Result %1$d of %2$d
fr: Résultat %1$d sur %2$d

source: No columns in common.
fr: Pas de colonnes en commun.
ko: 공통된 열이 없습니다.
tr: Ortak sütun yok.
vi: Không có cột chung.
zh_hans: 没有共有的列。
zh_hant: 沒有共有的欄位。

source: Set the connection's username to the IAM principal (a user email, or `name@project.iam` for a service account). The database password is not used.
fr: Définissez le nom d'utilisateur de la connexion sur le principal IAM (un e-mail d'utilisateur ou `nom@projet.iam` pour un compte de service). Le mot de passe de la base de données n'est pas utilisé.
ko: 연결의 사용자 이름을 IAM 주체(사용자 이메일 또는 서비스 계정의 경우 `name@project.iam`)로 설정하십시오. 데이터베이스 암호는 사용되지 않습니다.
tr: Bağlantının kullanıcı adını IAM principal'ı yapın (bir kullanıcı e-postası veya servis hesabı için `name@project.iam`). Veritabanı parolası kullanılmaz.
vi: Đặt tên đăng nhập của kết nối thành IAM principal (email người dùng, hoặc `name@project.iam` với tài khoản dịch vụ). Mật khẩu cơ sở dữ liệu không được dùng.
zh_hans: 将连接的用户名设为 IAM 主体（用户邮箱，或服务账号的 `name@project.iam`）。不会使用数据库密码。
zh_hant: 將連線的使用者名稱設為 IAM 主體（使用者電子郵件，或服務帳號的 `name@project.iam`）。不會使用資料庫密碼。

source: Remove jump host
fr: Supprimer l'hôte de saut
ko: 점프 호스트 제거
tr: Atlama sunucusunu kaldır
vi: Xóa jump host
zh_hans: 移除跳板机
zh_hant: 移除跳板主機

source: Database Name
fr: Nom de la base de données
ko: 데이터베이스 이름
tr: Veritabanı Adı
vi: Tên cơ sở dữ liệu
zh_hans: 数据库名称
zh_hant: 資料庫名稱

source: Search tables, views, databases, queries…
fr: Rechercher des tables, des vues, des bases de données, des requêtes...
ko: 테이블, 뷰, 데이터베이스, 쿼리 검색…
tr: Tabloları, görünümleri, veritabanlarını, sorguları ara…
vi: Tìm bảng, view, cơ sở dữ liệu, truy vấn…
zh_hans: 搜索表、视图、数据库、查询…
zh_hant: 搜尋資料表、檢視、資料庫、查詢…

# %@ has no column named %@
source: %1$@ has no column named %2$@
fr: %1$@ n'a pas de colonne nommée %2$@

source: foreign key
fr: Clé étrangère

source: The command must contain %@, where the local port goes
fr: La commande doit contenir %@, où va le port local.

source: Potentially Dangerous Queries
fr: Requêtes potentiellement dangereuses
ko: 잠재적으로 위험한 쿼리
vi: Truy vấn có thể nguy hiểm
zh_hans: 潜在危险查询
zh_hant: 潛在危險查詢

source: Show Favorites Sidebar
fr: Afficher la barre latérale des favoris
ko: 즐겨찾기 사이드바 보기
tr: Sık Kullanılanlar Sidebar'ını Göster
vi: Hiện thanh bên yêu thích
zh_hans: 显示收藏侧边栏
zh_hant: 顯示我的最愛側邊欄

source: Host
fr: Hôte
ko: 호스트
tr: Sunucu
vi: Máy chủ
zh_hans: 主机
zh_hant: 主機

source: Apply To
fr: Postuler à

source: These rows cannot be edited because TablePro cannot tell which table they came from.
fr: Ces lignes ne peuvent pas être modifiées car TablePro ne peut pas déterminer de quelle table elles proviennent.
ko: TablePro가 이 행들이 어느 테이블에서 왔는지 알 수 없어 편집할 수 없습니다.
tr: TablePro bu satırların hangi tablodan geldiğini bilemediği için bu satırlar düzenlenemez.
vi: Không thể sửa các dòng này vì TablePro không xác định được chúng đến từ bảng nào.
zh_hans: 无法编辑这些行，因为 TablePro 无法判断它们来自哪张表。
zh_hant: 無法編輯這些列，因為 TablePro 無法判斷它們來自哪張資料表。

source: Copy To…
fr: Copier vers...

source: Change cells in the grid and review the SQL before you save.
fr: Modifiez les cellules dans la grille et vérifiez la base de données SQL avant de l'enregistrer.
ko: 그리드에서 셀을 바꾸고 저장하기 전에 SQL을 검토하세요.
tr: Tablodaki hücreleri değiştirin ve kaydetmeden önce SQL'i inceleyin.
vi: Sửa ô ngay trong bảng và xem lại SQL trước khi lưu.
zh_hans: 在表格中修改单元格，保存前先检查 SQL。
zh_hant: 在表格中修改儲存格，儲存前先檢查 SQL。

source: Change Color
fr: Changer de couleur
ko: 색상 변경
tr: Rengi Değiştir
vi: Đổi màu
zh_hans: 更改颜色
zh_hant: 變更顏色

source: This connection's client certificate is not readable on this device (%@). Certificate files do not sync between devices, so add the certificate here before connecting.
fr: Le certificat client de cette connexion n'est pas lisible sur cet appareil (%@). Les fichiers de certificat ne se synchronisent pas entre les appareils, alors ajoutez le certificat ici avant de vous connecter.
ko: 이 기기에서 이 연결의 클라이언트 인증서를 읽을 수 없습니다(%@). 인증서 파일은 기기 간에 동기화되지 않으므로 연결하기 전에 이 기기에 인증서를 추가하십시오.
tr: Bu bağlantının istemci sertifikası bu cihazda okunamıyor (%@). Sertifika dosyaları cihazlar arasında eşitlenmez, bu yüzden bağlanmadan önce sertifikayı buraya ekleyin.
vi: Không đọc được chứng chỉ máy khách của kết nối này trên thiết bị này (%@). Tệp chứng chỉ không đồng bộ giữa các thiết bị, nên hãy thêm chứng chỉ tại đây trước khi kết nối.
zh_hans: 此连接的客户端证书在本设备上不可读（%@）。证书文件不会在设备之间同步，请先在此处添加证书再连接。
zh_hant: 此連線的用戶端憑證在本裝置上無法讀取（%@）。憑證檔案不會在裝置之間同步，請先在此處加入憑證再連線。

source: -- Empty the tables the rows go into
fr: -- Vider les tables dans lesquelles les lignes vont

source: If the object is already there
fr: Si l'objet est déjà là

source: Definitions
fr: Définitions
ko: 정의
tr: Tanımlar
vi: Định nghĩa
zh_hans: 定义
zh_hant: 定義

source: Revoke privileges from %@
fr: Revoyez les privilèges de %@
ko: %@의 권한 철회
tr: %@ hesabından yetkileri geri al
vi: Thu hồi quyền của %@
zh_hans: 撤销 %@ 的权限
zh_hant: 撤銷 %@ 的權限

source: Pending table changes belong to %@. Switch to that database to save them, or discard them.
fr: Les changements de table en attente appartiennent à %@. Passez à cette base de données pour les enregistrer ou les rejeter.
ko: 대기 중인 테이블 변경 사항은 %@에 속합니다. 저장하려면 해당 데이터베이스로 전환하거나, 변경 사항을 버리십시오.
tr: Bekleyen tablo değişiklikleri %@ veritabanına ait. Kaydetmek için o veritabanına geçin ya da değişiklikleri atın.
vi: Các thay đổi bảng đang chờ thuộc về %@. Hãy chuyển sang cơ sở dữ liệu đó để lưu, hoặc huỷ chúng.
zh_hans: 待处理的表更改属于 %@。请切换到该数据库进行保存，或者放弃这些更改。
zh_hant: 待處理的資料表變更屬於 %@。請切換到該資料庫進行儲存，或者捨棄這些變更。

source: Target filter
fr: Filtre cible

source: Choose Value
fr: Choisissez la valeur

source: Team Catalog
fr: Catalogue de l'équipe
ko: 팀 카탈로그
tr: Takım Kataloğu
vi: Danh mục nhóm
zh_hans: 团队目录
zh_hant: 團隊目錄

source: No table structure was sent.
fr: Aucune structure de table n'a été envoyée.

source: %1$d statements stay out of this run and %2$@ keeps what it has for them.
fr: Les déclarations %1$d restent hors de cette course et %2$@ garde ce qu'elle a pour eux.
ko: 구문 %1$d개는 이번 실행에서 제외되며, %2$@은(는) 해당 항목을 그대로 유지합니다.
tr: %1$d ifade bu çalıştırmanın dışında kalır ve %2$@ bunlar için mevcut hâlini korur.
vi: %1$d câu lệnh nằm ngoài lần chạy này và %2$@ giữ nguyên những gì đang có cho chúng.
zh_hans: %1$d 条语句不参与本次运行，%2$@ 中相关内容保持原样。
zh_hant: %1$d 條陳述式不參與本次執行，%2$@ 中相關內容維持原狀。

source: No saved connection named "%@".
fr: Aucune connexion enregistrée nommée "%@".
ko: 이름이 "%@"인 저장된 연결이 없습니다.
vi: Không có kết nối đã lưu tên "%@".
zh_hans: 没有名为 "%@" 的已保存连接。
zh_hant: 沒有名為「%@」的已儲存連線。

source: this Mac needs %@ free to open that database
fr: Ce Mac a besoin de %@ gratuit pour ouvrir cette base de données.
ko: 해당 데이터베이스를 열려면 이 Mac에 %@의 여유 공간이 필요합니다
tr: bu Mac'in o veritabanını açmak için %@ boş alana ihtiyacı var
vi: máy Mac này cần %@ dung lượng trống để mở cơ sở dữ liệu đó
zh_hans: 这台 Mac 需要 %@ 可用空间才能打开该数据库
zh_hant: 這台 Mac 需要 %@ 可用空間才能開啟該資料庫

source: Switch the active database on a connection
fr: Changer la base de données active sur une connexion
ko: 연결의 활성 데이터베이스를 전환합니다
tr: Bir bağlantıdaki etkin veritabanını değiştirir
vi: Chuyển cơ sở dữ liệu đang hoạt động trên một kết nối
zh_hans: 切换连接的活动数据库
zh_hant: 切換連線上使用中的資料庫

source: Suggested Actions
fr: Actions suggérées
ko: 제안된 작업
tr: Önerilen İşlemler
vi: Hành động gợi ý
zh_hans: 建议的操作
zh_hant: 建議的操作

source: A session can call tools on a server you add here once you allow it on a connection. Every call waits for you to approve it, and the arguments leave this Mac.
fr: Une session peut appeler des outils sur un serveur que vous ajoutez ici une fois que vous l'avez autorisé sur une connexion. Chaque appel attend que vous l'approuviez, et les arguments quittent ce Mac.

source: Can grant these privileges to others.
fr: Peut accorder ces privilèges à d'autres personnes.
ko: 이 권한을 다른 사용자에게 부여할 수 있습니다.
tr: Bu yetkileri başkalarına verebilir.
vi: Có thể cấp các quyền này cho người khác.
zh_hans: 可以将这些权限授予他人。
zh_hant: 可以將這些權限授予他人。

source: plus sign
fr: signe plus
ko: 더하기 기호
tr: artı işareti
vi: dấu cộng
zh_hans: 加号
zh_hant: 加號

source: Zoom In
fr: Zoom sur
ko: 확대
tr: Yakınlaştır
vi: Phóng to
zh_hans: 放大
zh_hant: 放大

source: Tiny Dot
fr: Petit point
ko: 작은 점
vi: Chấm nhỏ
zh_hans: 极小圆点
zh_hant: 極小圓點

source: Column comment
fr: Commentaire de colonne
ko: 열 주석
tr: Sütun yorumu
vi: Ghi chú cột
zh_hans: 列注释
zh_hant: 欄位註解

source: %lld statements
fr: %lld déclarations
ko: %lld개 SQL 문
tr: %lld ifade
vi: %lld câu lệnh
zh_hans: %lld 条语句
zh_hant: %lld 條陳述式

source: The Downloads folder is not available.
fr: Le dossier Téléchargements n'est pas disponible.
ko: 다운로드 폴더를 사용할 수 없습니다.
tr: İndirilenler klasörü kullanılamıyor.
vi: Thư mục Downloads không khả dụng.
zh_hans: 下载文件夹不可用。
zh_hant: 下載檔案夾無法使用。

source: Unknown SSH Host
fr: Serveur SSH inconnu
ko: 알 수 없는 SSH 호스트
tr: Bilinmeyen SSH Sunucusu
vi: Máy chủ SSH không xác định
zh_hans: 未知 SSH 主机
zh_hant: 未知的 SSH 主機

source: Delete %lld columns?
fr: Supprimer les colonnes %lld ?
ko: 열 %lld개를 삭제하시겠습니까?
tr: %lld sütun silinsin mi?
vi: Xóa %lld cột?
zh_hans: 删除 %lld 列？
zh_hant: 要刪除 %lld 個欄位嗎？

source: List the user-defined types in a schema, whichever shapes the engine has.
fr: Listez les types définis par l'utilisateur dans un schéma, quelle que soit la forme que prend le moteur.

source: Triggers
fr: Déclencheurs
ko: 트리거
tr: Tetikleyiciler
vi: Trigger
zh_hans: 触发器
zh_hant: 觸發器

source: Font size:
fr: Taille de la police :
ko: 글꼴 크기:
tr: Yazı tipi boyutu:
vi: Cỡ chữ:
zh_hans: 字体大小：
zh_hant: 字型大小：

source: Code expires in %d seconds
fr: Le code expire dans %d secondes
ko: 코드가 %d초 후 만료됩니다
tr: Kod %d saniye içinde sona erer
vi: Mã hết hạn sau %d giây
zh_hans: 代码将在 %d 秒后过期
zh_hant: 驗證碼將在 %d 秒後過期

source: The session is still working. Closing it stops the reply, and its conversation stays in the list.
fr: La session fonctionne toujours. La fermer arrête la réponse et sa conversation reste dans la liste.

source: Database the table lives in
fr: Base de données dans laquelle la table vit
ko: 테이블이 속한 데이터베이스
tr: Tablonun içinde bulunduğu veritabanı
vi: Cơ sở dữ liệu chứa bảng
zh_hans: 该表所在的数据库
zh_hant: 該資料表所在的資料庫

source: Tab id from list_recent_tabs
fr: Identifiant de la barre d'onglets de la liste_recent_tabs
ko: list_recent_tabs에서 얻은 탭 id
tr: list_recent_tabs'ten alınan sekme kimliği
vi: Tab id lấy từ list_recent_tabs
zh_hans: 来自 list_recent_tabs 的标签页 id
zh_hant: 來自 list_recent_tabs 的標籤頁 id

source: Name
fr: Nom
ko: 이름
tr: Ad
vi: Tên
zh_hans: 名称
zh_hant: 名稱

source: Tables and views in scope
fr: Tables et vues dans le champ d'application
ko: 범위 안의 테이블과 뷰
tr: Kapsamdaki tablolar ve görünümler
vi: Các bảng và view trong phạm vi
zh_hans: 范围内的表和视图
zh_hant: 範圍內的資料表和檢視表

source: Not compared
fr: Pas comparé
ko: 비교하지 않음
tr: Karşılaştırılmadı
vi: Chưa so sánh
zh_hans: 未比较
zh_hant: 未比較

source: Import Formats
fr: Formats d'importation
ko: 가져오기 형식
tr: İçe Aktarma Biçimleri
vi: Định dạng nhập
zh_hans: 导入格式
zh_hant: 匯入格式

source: With no precision on the source, the column keeps %1$lld digits, %2$lld after the point. A value with more is rounded or refused.
fr: Sans précision sur la source, la colonne conserve les %1$lld chiffres, %2$lld après le point. Une valeur supérieure est arrondie ou refusée.

source: No highlight rules
fr: Pas de règles de mise en évidence

source: No Operations Available
fr: Aucune opération disponible
ko: 사용 가능한 작업 없음
tr: Kullanılabilir İşlem Yok
vi: Không có thao tác nào
zh_hans: 没有可用操作
zh_hant: 沒有可用的操作

source: Table Actions
fr: Actions de table
ko: 테이블 작업
tr: Tablo İşlemleri
vi: Thao tác bảng
zh_hans: 表操作
zh_hant: 資料表操作

source: Connect to a saved database
fr: Se connecter à une base de données enregistrée
ko: 저장된 데이터베이스에 연결
tr: Kayıtlı bir veritabanına bağlan
vi: Kết nối tới cơ sở dữ liệu đã lưu
zh_hans: 连接到已保存的数据库
zh_hant: 連線到已儲存的資料庫

source: New Subgroup
fr: Nouveau sous-groupe
ko: 새 하위 그룹
tr: Yeni Alt Grup
vi: Nhóm con mới
zh_hans: 新建子分组
zh_hant: 新增子群組

source: Customize Toolbar…
fr: Personnaliser la barre d'outils...
ko: 도구 막대 사용자화…
tr: Araç Çubuğunu Özelleştir…
vi: Tuỳ chỉnh thanh công cụ…
zh_hans: 自定工具栏…
zh_hant: 自定工具列…

# (showing %d of %d rows)
source: (showing %1$d of %2$d rows)
fr: (affichage de %1$d sur %2$d lignes)
ko: (%1$d/%2$d행 표시 중)
tr: (%d / %d satır gösteriliyor)
vi: (đang hiển thị %d trên %d hàng)
zh_hans: （显示 %d / %d 行）
zh_hant: （顯示 %1$d / %2$d 列）

source: Generation failed.
fr: Génération échouée.
ko: 생성하지 못했습니다.
tr: Oluşturma başarısız.
vi: Tạo phản hồi thất bại.
zh_hans: 生成失败。
zh_hant: 產生失敗。

source: Update Available…
fr: Mise à jour disponible...

source: (^[%lld statement](inflect: true))
fr: (^[%lld instruction](inflect: true))
ko: (%lld문)
tr: (%lld statement)
vi: (%lld câu lệnh)
zh_hans: (%lld条语句)
zh_hant: (%lld陳述式)

source: Re-read the file with these settings. This discards unsaved changes.
fr: Relisez le fichier avec ces paramètres. Cela rejette les modifications non enregistrées.
ko: 이 설정으로 파일을 다시 읽습니다. 저장하지 않은 변경 사항은 삭제됩니다.
tr: Dosyayı bu ayarlarla yeniden okur. Bu, kaydedilmemiş değişiklikleri atar.
vi: Đọc lại tệp với các cài đặt này. Thao tác này bỏ các thay đổi chưa lưu.
zh_hans: 使用这些设置重新读取文件。未保存的更改会被丢弃。
zh_hant: 使用這些設定重新讀取檔案。未儲存的變更會被捨棄。

source: Editable Hex
fr: Hexadecimal modifiable
ko: 편집 가능한 16진수
tr: Düzenlenebilir Hex
vi: Hex có thể chỉnh sửa
zh_hans: 可编辑十六进制
zh_hant: 可編輯十六進位

source: The %@ command line tool is not installed.
fr: L'outil de ligne de commande %@ n'est pas installé.
ko: %@ 명령줄 도구가 설치되어 있지 않습니다.
tr: %@ komut satırı aracı yüklü değil.
vi: Công cụ dòng lệnh %@ chưa được cài đặt.
zh_hans: 尚未安装 %@ 命令行工具。
zh_hant: 尚未安裝 %@ 命令列工具。

source: Undo Delete
fr: Annuler la suppression
ko: 삭제 실행 취소
tr: Silmeyi Geri Al
vi: Hoàn tác xóa
zh_hans: 撤销删除
zh_hant: 復原刪除

source: Insert
fr: Insérer
ko: 삽입
tr: Ekle
vi: Chèn
zh_hans: 插入
zh_hant: 插入

source: License key or invite code
fr: Clé de licence ou code d'invitation
ko: 라이선스 키 또는 초대 코드
tr: Lisans anahtarı veya davet kodu
vi: Khóa giấy phép hoặc mã mời
zh_hans: 许可证密钥或邀请码
zh_hant: 授權金鑰或邀請碼

source: Distributed SQL query engine for data lakes
fr: Moteur de requêtes SQL distribué pour les lacs de données
ko: 데이터 레이크용 분산 SQL 쿼리 엔진
tr: Veri gölleri için dağıtık SQL sorgu motoru
vi: Công cụ truy vấn SQL phân tán cho data lake
zh_hans: 面向数据湖的分布式 SQL 查询引擎
zh_hant: 適用於資料湖的分散式 SQL 查詢引擎
